fsi-workflow/04_fluidSimulation/solution_water_Re50000/Fluid/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.135;

boundaryField
{

    //#includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    far
    {
        type            zeroGradient;
    }
    
    naca2312
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    
    
    symmetry
    {
        type            symmetryPlane;
    }
    
}

// ************************************************************************* //

