fsi-workflow/04_fluidSimulation/solution_water_Re50000/Fluid/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    //default         Gauss linear;
    //grad(p)         Gauss linear;

    //default 	     cellLimited leastSquares 1;
    default 	     cellLimited Gauss linear 0.5;

    grad(U) 	     cellMDLimited Gauss linear 1.0;
}

divSchemes
{
    default         none;

    //div(phi,U)      	Gauss linear;
    //div(phi,U)      	Gauss limitedLinearV 1;
    div(phi,U)      	Gauss linearUpwind grad(U);
    //div(phi,U)      	Gauss upwind;

    div(phi,omega) 		Gauss linearUpwind default;
    // div(phi,epsilon) 	Gauss linearUpwind default;
    div(phi,k) 			Gauss linearUpwind default;

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited 0.5;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 0.5;
}

wallDist
{
    method meshWave;
}


fluxRequired
{
    default         no;
    p               ;
    Phi             ;
}


// ************************************************************************* //
